In [1]:
import pandas as pd
import numpy as np
df=pd.read_csv('Total.csv',low_memory=False)
df.head()

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,Not Provided,567595.43,567595.43,2011
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,Not Provided,538909.28,538909.28,2011
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,Not Provided,335279.91,335279.91,2011
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,Not Provided,332343.61,332343.61,2011
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,Not Provided,326373.19,326373.19,2011

# clean data and pre processing

In [2]:
df.columns=df.columns.str.strip()

In [3]:
df['EmployeeName']=df['EmployeeName'].str.lower()

In [4]:
df['JobTitle']=df['JobTitle'].str.lower()

In [5]:
df.head()

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,nathaniel ford,general manager-metropolitan transit authority,167411.18,0.00,400184.25,Not Provided,567595.43,567595.43,2011
1,gary jimenez,captain iii (police department),155966.02,245131.88,137811.38,Not Provided,538909.28,538909.28,2011
2,albert pardini,captain iii (police department),212739.13,106088.18,16452.60,Not Provided,335279.91,335279.91,2011
3,christopher chong,wire rope cable maintenance mechanic,77916.00,56120.71,198306.90,Not Provided,332343.61,332343.61,2011
4,patrick gardner,"deputy chief of department,(fire department)",134401.60,9737.00,182234.59,Not Provided,326373.19,326373.19,2011

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 312882 entries, 0 to 312881
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      312882 non-null  object
 1   JobTitle          312882 non-null  object
 2   BasePay           312882 non-null  object
 3   OvertimePay       312882 non-null  object
 4   OtherPay          312882 non-null  object
 5   Benefits          312882 non-null  object
 6   TotalPay          312882 non-null  float64
 7   TotalPayBenefits  312882 non-null  float64
 8   Year              312882 non-null  int64
dtypes: float64(2), int64(1), object(6)
memory usage: 21.5+ MB

In [7]:
df['BasePay']=pd.to_numeric(df['BasePay'],errors='coerce')
df['OvertimePay']=pd.to_numeric(df['OvertimePay'],errors='coerce')
df['OtherPay']=pd.to_numeric(df['OtherPay'],errors='coerce')
df['Benefits']=pd.to_numeric(df['Benefits'],errors='coerce')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 312882 entries, 0 to 312881
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      312882 non-null  object
 1   JobTitle          312882 non-null  object
 2   BasePay           312276 non-null  float64
 3   OvertimePay       312881 non-null  float64
 4   OtherPay          312881 non-null  float64
 5   Benefits          276722 non-null  float64
 6   TotalPay          312882 non-null  float64
 7   TotalPayBenefits  312882 non-null  float64
 8   Year              312882 non-null  int64
dtypes: float64(6), int64(1), object(2)
memory usage: 21.5+ MB

In [8]:
df.isnull().sum()

EmployeeName            0
JobTitle                0
BasePay               606
OvertimePay             1
OtherPay                1
Benefits            36160
TotalPay                0
TotalPayBenefits        0
Year                    0
dtype: int64

In [9]:
df['BasePay']=df['BasePay'].fillna(0)
df['OvertimePay']=df['OvertimePay'].fillna(0)
df['OtherPay']=df['OtherPay'].fillna(0)
df['Benefits']=df['Benefits'].fillna(0)
df.isnull().sum()

EmployeeName        0
JobTitle            0
BasePay             0
OvertimePay         0
OtherPay            0
Benefits            0
TotalPay            0
TotalPayBenefits    0
Year                0
dtype: int64

In [10]:
df.duplicated().any().sum()

0

In [11]:
df.head()

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,nathaniel ford,general manager-metropolitan transit authority,167411.18,0.00,400184.25,0.0,567595.43,567595.43,2011
1,gary jimenez,captain iii (police department),155966.02,245131.88,137811.38,0.0,538909.28,538909.28,2011
2,albert pardini,captain iii (police department),212739.13,106088.18,16452.60,0.0,335279.91,335279.91,2011
3,christopher chong,wire rope cable maintenance mechanic,77916.00,56120.71,198306.90,0.0,332343.61,332343.61,2011
4,patrick gardner,"deputy chief of department,(fire department)",134401.60,9737.00,182234.59,0.0,326373.19,326373.19,2011

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 312882 entries, 0 to 312881
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      312882 non-null  object
 1   JobTitle          312882 non-null  object
 2   BasePay           312882 non-null  float64
 3   OvertimePay       312882 non-null  float64
 4   OtherPay          312882 non-null  float64
 5   Benefits          312882 non-null  float64
 6   TotalPay          312882 non-null  float64
 7   TotalPayBenefits  312882 non-null  float64
 8   Year              312882 non-null  int64
dtypes: float64(6), int64(1), object(2)
memory usage: 21.5+ MB

In [13]:
df.to_csv('Totalf.csv',index=False)

# 1. Basic Information:
### How many records (rows) and fields (columns) are there in the dataset?
### What are the names of the columns in the dataset?
### What are the data types of each column?

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 312882 entries, 0 to 312881
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      312882 non-null  object
 1   JobTitle          312882 non-null  object
 2   BasePay           312882 non-null  float64
 3   OvertimePay       312882 non-null  float64
 4   OtherPay          312882 non-null  float64
 5   Benefits          312882 non-null  float64
 6   TotalPay          312882 non-null  float64
 7   TotalPayBenefits  312882 non-null  float64
 8   Year              312882 non-null  int64
dtypes: float64(6), int64(1), object(2)
memory usage: 21.5+ MB

### How many records (rows)

In [15]:
df.shape[0]

312882

### How many Columns

In [16]:
col = df.columns
x=len(col)
x

9

### What are the names of the columns in the dataset?

In [17]:
col = df.columns
col

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 312882 entries, 0 to 312881
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      312882 non-null  object
 1   JobTitle          312882 non-null  object
 2   BasePay           312882 non-null  float64
 3   OvertimePay       312882 non-null  float64
 4   OtherPay          312882 non-null  float64
 5   Benefits          312882 non-null  float64
 6   TotalPay          312882 non-null  float64
 7   TotalPayBenefits  312882 non-null  float64
 8   Year              312882 non-null  int64
dtypes: float64(6), int64(1), object(2)
memory usage: 21.5+ MB

# 2. Salary Overview:

### What is the average salary for the entire dataset?

In [19]:
df['TotalPayBenefits'].mean()

100928.33977713643

### What is the highest and lowest salary recorded in the dataset?

In [20]:
df['TotalPayBenefits'].max()

712802.36

In [21]:
df['TotalPayBenefits'].min()

-3628.78

### What is the distribution of salaries across different pay scales?

In [22]:
relvevant_column=['JobTitle','BasePay','TotalPayBenefits']
data_subset=df[relvevant_column]
corelation=data_subset['BasePay'].corr(data_subset['TotalPayBenefits'])
print('corelation between BasePay and TotalPayBenefits : ',corelation)

corelation between BasePay and TotalPayBenefits :  0.9560542978806547

# 3. Yearly Trends:

### How does the average salary change from year to year?

In [23]:
df.groupby(['Year']).mean()['TotalPayBenefits']

C:\Users\elshazly.abouelhamd\AppData\Local\Temp\ipykernel_21548\970515188.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(['Year']).mean()['TotalPayBenefits']

Year
2011     71744.103871
2012    100553.229232
2013    101440.519714
2014    100261.438668
2015    101725.909937
2016    104581.440982
2017    109669.462197
2018    113474.363514
Name: TotalPayBenefits, dtype: float64

### What is the overall salary trend over the years?

In [24]:
df.groupby(['Year']).max()['TotalPayBenefits']

Year
2011    567595.43
2012    407274.78
2013    425815.28
2014    510732.68
2015    633723.33
2016    641845.82
2017    666180.14
2018    712802.36
Name: TotalPayBenefits, dtype: float64

# 4. Department Analysis:

# •	Which departments (JobTitle) have the highest and lowest average salaries?

## highest average salaries

In [25]:
x=df.groupby(['JobTitle']).mean()['TotalPayBenefits']
e=x.sort_values(ascending=False) 
e.head(1)

C:\Users\elshazly.abouelhamd\AppData\Local\Temp\ipykernel_21548\2353739472.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  x=df.groupby(['JobTitle']).mean()['TotalPayBenefits']

JobTitle
chief investment officer    611728.638
Name: TotalPayBenefits, dtype: float64

#### lowest average salaries

In [26]:
x=df.groupby(['JobTitle']).mean()['TotalPayBenefits']
e=x.sort_values(ascending=True) 
e.head(1)

C:\Users\elshazly.abouelhamd\AppData\Local\Temp\ipykernel_21548\4052677136.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  x=df.groupby(['JobTitle']).mean()['TotalPayBenefits']

JobTitle
public safety communications technician    149.51
Name: TotalPayBenefits, dtype: float64

## How does the salary distribution vary across different departments(JobTitle)?

In [27]:
df.groupby(['JobTitle']).sum()['TotalPayBenefits']

C:\Users\elshazly.abouelhamd\AppData\Local\Temp\ipykernel_21548\245790111.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(['JobTitle']).sum()['TotalPayBenefits']

JobTitle
account clerk                                     38551598.23
accountant                                          237146.34
accountant i                                       1089113.48
accountant ii                                     41669482.21
accountant ii (ocii)                                287567.90
                                                     ...
worker's compensation supervisor i                  455103.63
x-ray laboratory aide                              8339390.26
youth comm advisor                                  627846.43
youth commission advisor, board of supervisors       53632.87
zoo curator                                          66686.56
Name: TotalPayBenefits, Length: 1755, dtype: float64

# 5. Top Earners:

### Who are the top 10 earners in the dataset?

In [28]:

x=df.groupby(['EmployeeName']).max()['TotalPayBenefits']
e=x.sort_values(ascending=False) 
e.head(10)

EmployeeName
paulo morgado            712802.36
william j coaker jr.     680669.54
nathaniel ford           567595.43
david e francl           565892.29
arthur l wang            551116.09
ronald terry             546240.06
susan p ehrlich          543131.18
gary jimenez             538909.28
ellen munson brownell    516972.39
david shinn              510732.68
Name: TotalPayBenefits, dtype: float64

### •	Which department(JobTitle) has the highest number of top earners?

In [47]:
x=df.groupby(['JobTitle']).max()['TotalPayBenefits']
e=x.sort_values(ascending=False) 
e.head(1)

JobTitle
police officer 3    712802.36
Name: TotalPayBenefits, dtype: float64

# 7. Overtime Analysis:

### What is the proportion of employees who receive overtime pay?

In [30]:
x=df['EmployeeName'].count()
z=df['OvertimePay']>0
p=df[z].count()['OvertimePay']
proportion=(p/x)*100
proportion

48.824157350055295

### How does overtime pay affect the overall salary distribution?

In [31]:
relvevant_column=['JobTitle','OvertimePay','TotalPayBenefits']
data_subset=df[relvevant_column]
corelation=data_subset['OvertimePay'].corr(data_subset['TotalPayBenefits'])
print('corelation between OvertimePay and TotalPayBenefits : ',corelation)

corelation between OvertimePay and TotalPayBenefits :  0.47414017352943233

# 8. Benefits Analysis:

### What are the most common benefits offered to employees?

In [32]:
w=df['Benefits']==df['Benefits'].where(df['Benefits']>0)
x=df[w].groupby(['Benefits']).count()['EmployeeName']
e=x.sort_values(ascending=False) 
e.head(1)

Benefits
7959.18    348
Name: EmployeeName, dtype: int64

### Is there a correlation between benefits and salaries?

In [33]:
relvevant_column=['JobTitle','Benefits','TotalPayBenefits']
data_subset=df[relvevant_column]
corelation=data_subset['Benefits'].corr(data_subset['TotalPayBenefits'])
print('corelation between Benefits and TotalPayBenefits : ',corelation)

corelation between Benefits and TotalPayBenefits :  0.8550886158509741

In [34]:
df['Benefits'].corr(df['TotalPayBenefits'])

0.8550886158509741

# 9. Top Paid Job Titles:

### What are the top 10 job titles with the highest average salaries?

In [35]:
x=df.groupby(['JobTitle']).mean()['TotalPayBenefits']
e=x.sort_values(ascending=False) 
e.head(10)

C:\Users\elshazly.abouelhamd\AppData\Local\Temp\ipykernel_21548\539274456.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  x=df.groupby(['JobTitle']).mean()['TotalPayBenefits']

JobTitle
chief investment officer                          611728.638000
physician administrator, dph                      454471.806667
managing director                                 438767.559091
chief, fire department                            417767.857143
general manager-metropolitan transit authority    399211.275000
gen mgr, public trnsp dept                        389126.942857
assistant chief of police                         387003.872500
administrator, dph                                374311.562857
dept head v                                       365736.799048
dep dir for investments, ret                      355731.260000
Name: TotalPayBenefits, dtype: float64

## How many employees are in debt, name of them and Amount of indebtednessfor them ?

###  count of employees are in debt

In [36]:
w=df['TotalPayBenefits'].where(df['TotalPayBenefits']<0)
w.count()

10

### name of them and Amount of indebtednessfor them

In [37]:
z=df['TotalPayBenefits']<0
df[z][['EmployeeName','TotalPayBenefits']]

                    EmployeeName  TotalPayBenefits
110528          timothy e gibson             -2.73
110529            mark e laherty             -8.20
110530             david p kucia            -33.89
148649                 joe lopez           -618.13
188036                lubna kaur           -295.32
229004             rana calonsag            -11.32
229005             bruce w moore            -13.15
229006              elvira james            -53.31
270571  carlos r castro santiago           -577.47
270572           melinda r valle          -3628.78

# •	What are the 5 departments that have the most indebted employees?

In [38]:
z=df['TotalPayBenefits']<0
r=df[z][['JobTitle','TotalPayBenefits']]
t=r.sort_values(by='TotalPayBenefits',ascending=True) 
t.head(5)

                             JobTitle  TotalPayBenefits
270572  medical evaluations assistant          -3628.78
148649     counselor, log cabin ranch           -618.13
270571                      custodian           -577.47
188036        ps aide health services           -295.32
229006                    secretary 2            -53.31

# •	what is the most year in paying overtime allowance?

In [39]:
x=df.groupby(['Year']).sum()['OvertimePay']
e=x.sort_values(ascending=False) 
e.head(1)

C:\Users\elshazly.abouelhamd\AppData\Local\Temp\ipykernel_21548\1234416101.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  x=df.groupby(['Year']).sum()['OvertimePay']

Year
2018    2.854499e+08
Name: OvertimePay, dtype: float64

# •	What is the highest Over time allowance paid and what is the name of the paid employee?

In [40]:
x=df['OvertimePay']==df['OvertimePay'].max()
df[x][['EmployeeName','OvertimePay']]

              EmployeeName  OvertimePay
270579  antonio b santiago    309481.03

# •	How many employees whom Base Pay  Equal Zero

In [41]:
count = (df['BasePay'] == 0).sum()
print('Count of employees whom BasePay Equal Zero : ', count)

Count of employees whom BasePay Equal Zero :  3852

#  •	How many unique departments?

In [42]:

r=pd.DataFrame(df['JobTitle'].unique()).count()
r

0    1755
dtype: int64

# •	How many unique departments for each year

In [43]:
df.groupby('Year')['JobTitle'].nunique()

Year
2011    1045
2012    1044
2013    1051
2014     996
2015    1010
2016    1009
2017    1017
2018    1000
Name: JobTitle, dtype: int64

# 10. Employee Distribution:

### •	How many employees work in each department(JobTitle)?

In [44]:
df.groupby(['JobTitle']).count_distinct()['EmployeeName']

JobTitle
account clerk                                     629
accountant                                          5
accountant i                                       15
accountant ii                                     435
accountant ii (ocii)                                3
                                                 ...
worker's compensation supervisor i                  5
x-ray laboratory aide                             129
youth comm advisor                                  9
youth commission advisor, board of supervisors      1
zoo curator                                         1
Name: EmployeeName, Length: 1755, dtype: int64

### •	What is the percentage distribution of employees across different departments?

In [45]:
Total_Employee=df['EmployeeName'].count()
percentage =(df.groupby(['JobTitle']).count()['EmployeeName']/Total_Employee)*100
percentage

JobTitle
account clerk                                     0.201034
accountant                                        0.001598
accountant i                                      0.004794
accountant ii                                     0.139030
accountant ii (ocii)                              0.000959
                                                    ...
worker's compensation supervisor i                0.001598
x-ray laboratory aide                             0.041230
youth comm advisor                                0.002876
youth commission advisor, board of supervisors    0.000320
zoo curator                                       0.000320
Name: EmployeeName, Length: 1755, dtype: float64